docs/blog/posts/car_living.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-25 Thu 19:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Car Camping in Urbana-Champaign</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Car Camping in Urbana-Champaign
<br />
<span class="subtitle">Lessons learned from 2 weeks living out of a Honda HR-V</span>
</h1>
<p>
<b>TLDR: Being homeless sucks, and while car-living may not seem "that bad", it definitely can be.</b>
</p>

<p>
In my college town(s), Urbana-Champaign, almost all leases have a 2-week gap for turnover, right before the start of the semester. 
This means that anyone looking to move is out of housing for 2 weeks. Standard procedure is to go home or stay with a friend who isn't switching apartments if you need to be on campus, but this year, I wanted to try something different: living out of my car.
</p>

<p>
I've actually been curious about car living for a while: I'm someone who spends almost no waking time at home and I <a href="huel.html">don't need a kitchen to cook or store food</a>. 
On top of that, I have always disliked the idea of believing things are <i>essential</i> just because society has agreed upon it. Not everyone wants to own "space", and while I do see some value in it, I believe what I pay in rent has often exceeded the value I get from an apartment. 
In an ideal world, I'd love to be able to lease a bed in a capsule hotel/hostel style building long-term for the added safety + climate control, but a car seems like the closest thing actually available.
</p>

<p>
Obviously, there are complications, which is most of why I haven't committed to car living long term yet.
Not having a permanent address in IL could cause some issues with the government, and IL winters are cold enough I'm worried sleeping in an unheated car could have risks (even with a properly rated sleeping bag).
But for 2 weeks during the summer when it's warm and campus is quiet, what could really go wrong?
Sleeping in your car is entirely legal where I live as long as you don't park in a metered spot or on private property. Urbana in particular has plenty of relatively secluded street parking.
</p>

<p>
In the coming summers, I plan to intern off campus, and saving 3 months rent in a high CoL area is enticing, so long as I know in advance that car-camping won't severly impact my quality of life. This year's lease gap was the perfect time for a trial run!
</p>
<div id="outline-container-orgfce2ca2" class="outline-2">
<h2 id="orgfce2ca2">The Before</h2>
<div class="outline-text-2" id="text-orgfce2ca2">
</div>
<div id="outline-container-org51b3245" class="outline-3">
<h3 id="org51b3245">Preparation</h3>
<div class="outline-text-3" id="text-org51b3245">
<ul class="org-ul">
<li>Hard to decide what I would / wouldn't need, probably overpacked clothes</li>
<li>I do BJJ so I needed my Gis which would take up lots of space. Also was a bit worried about smell of used gym clothes</li>
<li>Bought covers for windows, cleaned car interior</li>
<li>4 bags: BJJ gym duffel, work backpack, toiletries backpack (held all toiletries to not look conspicuous in crunch), small suitcase of clothes</li>
<li>put yoga mat on flattened seat and brought bedsheets</li>
</ul>
</div>
</div>
<div id="outline-container-org093f809" class="outline-3">
<h3 id="org093f809">The Plan</h3>
<div class="outline-text-3" id="text-org093f809">
<ul class="org-ul">
<li>bathroom at office, 24/7 access to many school buildings</li>
<li>morning gym for lifting (already do this) + shower there and brush teeth</li>
<li>afternoon gym (BJJ) then shower (again) + evening routing (easy bc women's restroom is usually empty)</li>
<li>on weekends, shower once (after lifting) and brush teeth in a school building or coffee shop restroom</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb1141a3" class="outline-2">
<h2 id="orgb1141a3">During</h2>
<div class="outline-text-2" id="text-orgb1141a3">
</div>
<div id="outline-container-org01390c4" class="outline-3">
<h3 id="org01390c4">Day 1</h3>
<div class="outline-text-3" id="text-org01390c4">
<ul class="org-ul">
<li>After evening gym sesh went to work/study for a bit on campus, brushed teeth there</li>
<li>Wasn't stressed well in advance, but definitely felt a bit on edge trying to fall asleep. Window covers weren't perfect, so if someone tried they could see in</li>
<li>Originally only cracked the windows very slightly and it got HOT -&gt; had to go back and crack more, probably should've gone even further
<ul class="org-ul">
<li>Was scared of bugs + felt weird hearing things / ppl walking by. Also just don't like being exposed ot the outside</li>
</ul></li>
<li>Took a while to fall asleep but once asleep it was fine</li>
<li>Woke up to my alarm at 5:40am, was already bright outside, drove to gym and all was good</li>
<li>Luckily no issues w/ needing a bathroom :skull: -&gt; but also pretty sure I was dehydrated after gym</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc61c0f" class="outline-3">
<h3 id="orgcc61c0f">Days 2, 3</h3>
<div class="outline-text-3" id="text-orgcc61c0f">
<ul class="org-ul">
<li>Went to CA, no car sleeping</li>
</ul>
</div>
</div>
<div id="outline-container-org63f0f87" class="outline-3">
<h3 id="org63f0f87">Day 4</h3>
<div class="outline-text-3" id="text-org63f0f87">
<ul class="org-ul">
<li>drove back from airport (~2 hours), was exhausted
<ul class="org-ul">
<li>slept super easily</li>
</ul></li>
<li>Gym closes sunday night so no shower, just used restroom on campus and then went to park</li>
<li>left front windows halfway open, no issue w/ fogging up / getting too hot</li>
</ul>
</div>
</div>
<div id="outline-container-org580e7fb" class="outline-3">
<h3 id="org580e7fb">Days 5-9</h3>
<div class="outline-text-3" id="text-org580e7fb">
</div>
<div id="outline-container-org44dbf47" class="outline-4">
<h4 id="org44dbf47">Day</h4>
<div class="outline-text-4" id="text-org44dbf47">
<ul class="org-ul">
<li>Didn't sleep great, really really tired afterwards</li>
</ul>
</div>
</div>
<div id="outline-container-org981ddf3" class="outline-4">
<h4 id="org981ddf3">Day 6</h4>
<div class="outline-text-4" id="text-org981ddf3">
<ul class="org-ul">
<li>Parked in a different spot b/c I had spent 2 in a row same spot, was a bit nervous bc didn't know the area / change</li>
<li>Less street lights tho (also I think maybe I was behind a van someone was living out of??) -&gt; related note, I could 1000% live in a van full time, it would solve all my problems (space, privacy)</li>
</ul>
</div>
</div>
<div id="outline-container-org62bd3cc" class="outline-4">
<h4 id="org62bd3cc">Day 7</h4>
<div class="outline-text-4" id="text-org62bd3cc">
<ul class="org-ul">
<li>Gym in morning</li>
<li>Gym again in evening -&gt; went to my friend's muay thai gym bc I've been considering cross-training (my mma gym has muay thai but it's almost always sparring no technique) -&gt; they had no shower :sob:
<ul class="org-ul">
<li>had to go back to crunch late at night, do some cardio / abs to not be suspicious, and then go find somewhere to sleep</li>
</ul></li>
<li>Awful sleep -&gt; super hot (was still high 70s at 2am) and I had to pee twice (midnight at gas station, 2am on campus) + was dehydrated. 
<ul class="org-ul">
<li>Only ended up getting 3 hours solid sleep according ot my watch</li>
<li>Very frustrated</li>
</ul></li>
<li>also started to notice bug bites</li>
</ul>
</div>
</div>
<div id="outline-container-org2dd4232" class="outline-4">
<h4 id="org2dd4232">Day 8</h4>
<div class="outline-text-4" id="text-org2dd4232">
<ul class="org-ul">
<li>today was awful, so tired, couldn't do anything</li>
<li>gave up and booked a hotel, slept 5pm - 9am, skipped gym + everything else I needed to do</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0a9a95" class="outline-4">
<h4 id="orgf0a9a95">Day 9</h4>
<div class="outline-text-4" id="text-orgf0a9a95">
<ul class="org-ul">
<li>Picked up a blood sugar monitor, wasn't sure how temp sensitive so keeping in office (been having low blood sugar scares)</li>
<li>went to my MMA gym in the evening (BJJ + women's class) -&gt; showered there but clothes were too sweaty to leave, had to go do laundry (my friend gave me quarters)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgab6db3a" class="outline-3">
<h3 id="orgab6db3a">Nights 10 + 11</h3>
<div class="outline-text-3" id="text-orgab6db3a">
</div>
<div id="outline-container-org533ccf9" class="outline-4">
<h4 id="org533ccf9">Day 10</h4>
<div class="outline-text-4" id="text-org533ccf9">
<ul class="org-ul">
<li>the weekend</li>
<li>bbq 10-5, got soooo sweaty (but also was fun)</li>
<li>slept in lab</li>
</ul>
</div>
</div>
<div id="outline-container-orgf15006f" class="outline-4">
<h4 id="orgf15006f">Day 11</h4>
<div class="outline-text-4" id="text-orgf15006f">
<ul class="org-ul">
<li>slept in lab, someone came to work at 11pm tho</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org30a05ca" class="outline-3">
<h3 id="org30a05ca">Nights 12-15</h3>
<div class="outline-text-3" id="text-org30a05ca">
</div>
<div id="outline-container-orgc565320" class="outline-4">
<h4 id="orgc565320">Day 12</h4>
<div class="outline-text-4" id="text-orgc565320">
<ul class="org-ul">
<li>Went to MMA gym for BJJ then Vonnora Muay Thai (back to back) ? -&gt; maybe not doable</li>
<li>slept in lab, someone was working until 1am tho, I slept on other side of room to give him space but not ideal, felt bad</li>
</ul>
</div>
</div>
<div id="outline-container-org0f782ac" class="outline-4">
<h4 id="org0f782ac">Day 13</h4>
<div class="outline-text-4" id="text-org0f782ac">
<ul class="org-ul">
<li>TIRED again, gym was rough in the morning, didn't go in the evening</li>
<li>gave up and booked a hotel</li>
<li>also it was rainign</li>
<li>and 90 degrees</li>
</ul>
</div>
</div>
<div id="outline-container-org2e692e5" class="outline-4">
<h4 id="org2e692e5">Day 14</h4>
<div class="outline-text-4" id="text-org2e692e5">
<ul class="org-ul">
<li>Muay thai again -&gt; side not really like the gym + the kru there</li>
<li>no morning gym (12 hours of sleep)</li>
</ul>
</div>
</div>
<div id="outline-container-orgecb593b" class="outline-4">
<h4 id="orgecb593b">Day 15</h4>
<div class="outline-text-4" id="text-orgecb593b">
<ul class="org-ul">
<li>last night thank god!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org84092a8" class="outline-2">
<h2 id="org84092a8">Reflections</h2>
<div class="outline-text-2" id="text-org84092a8">
<ul class="org-ul">
<li>most important question: would I do it again / would it be sustainable for longer</li>
<li>what is most difficult
<ul class="org-ul">
<li>storing stuff -&gt; was worried about stuff getting moldy / damaged in car, shampoo kept exploding in the heat</li>
<li>If I were to do long term, would invest in storage thing for top of car, get sweaty clothes + shoes isolated</li>
</ul></li>
<li>unfortunately was during a heat wave: didn't get below 74 at night some nights, 100+ during the day</li>
<li>excercising at night causes problems bc dehydration + having to pee due to water consumption, also I work out hard enough during MMA to get nauseous, sometimes puke</li>
<li>started eating really badly bc of stress, stress hives, swollen lymph nodes
<ul class="org-ul">
<li>having blood sugar issues so that's not good</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org974f95b" class="outline-2">
<h2 id="org974f95b">TODOs for me</h2>
<div class="outline-text-2" id="text-org974f95b">
<ul class="org-ul">
<li>had to interview a postdoc canidate in opposite time zone -&gt; had to be up late (kms) w/ no ability to sleep in.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-09-25 Thu 19:07</p>
</div>
</body>
</html>
